package a00_exp.a06_1218;
/*
 # 한 주간을 정리하면서
 1. 메서드의 기본 구성요소를 기본 예제와 함께 기술하세요.
 2. 완성도 있는 자판기 프로그램을 구현하세요.
 	1) 객체를 이용해서
 		생성자: 자판기명(음료/점심식사..)
 		메서드1: 금액 투입(총금액누적처리)
 		메서드2: 메뉴보이기
 		메서드3: 메뉴선택 - 투입한 금액과 함께 물건 리턴
 		메서드4: 잔액 리턴처리
 	2) 기본 자판기 예제를 활용하여 완성도 있게 만들어 보세요
 3. 필기구와 노트를 1:1 관계로 설정하여
 		@@필기구를 이용하여 노트에 @@를 기록하다.
 		객체 1:1 관계 설정으로 프로그램을 처리하세요.
 4. 기차예매표 처리 프로그램 - 기차객체와 좌석별 내용을 1:다 관계로 설정하세요.
 		기차클래스: 서울~부산
 		좌석클래스: @@호차 @@번호 예약여부
 		## 중간에 구간으로 정해서 예매처리.(할 수 있으면 하기)
 5. final, static의 개념을 기본 예제를 통해 설명하세요.
 6. 접근제어자의 종류와 범위를 기술하되, default, protected에 관련하여 기본 예제를 만들어 기술하세요.
 7. 상속의 멤버(생성자, 필드, 메서드)별로 접근제어와 재정의에 대하여 기능별로 기술하세요.
 8. 상속에서 Robot을 추상클래스로 정의하고 하위에 실제 클래스를 Tv, Dagan, MZ를 선언하여 처리할 수 있도록 하고,
 	interface는 Weapon으로, 하위에 여러 무기(로켓포, 레이저빔 등)를 처리할 수 있게 하고,
 	각 로봇마다 무기를 여러 가지 장착 가능하게 처리하세요.\
 	(오버라이딩, 공통메서드를 활용하여 처리해보세요.)
 9. 예외 처리에서 런타임시 예외와 필수 예외를 처리하는 방법을 기본예제를 통해 설명하세요.
 10. 사용자정의예외를 구성하되, Scanner로 입력한 값이 id, pw가 맞지 않을 때,
 	 정의된 예외 클래스를 통해서 처리되는 프로그램을 구현하세요. 
 11. 데이터베이스 설치 관련 내용을 캡쳐를 통해 설치되는 절차를 정리하여 ppt 파일로 만들어 보세요.
 
 */
public class A00 {

}
